In [1]:
import pandas as pd
col_names=['sl_no','age','gender','role','id']
data=pd.read_table("../files/ex.txt",sep="|",names=col_names)
data.columns

Index(['sl_no', 'age', 'gender', 'role', 'id'], dtype='object')

In [11]:
data.head()

   sl_no   age gender        role     id
0      1  24.0      M  technician  85711
1      2   NaN      F       other  94043
2      3   NaN      M      writer  32067
3      4  24.0      M  technician  43537
4      5  33.0      F       other  15213

In [14]:
#axis=1 for columns-y axis and axis=0 for rows
data.drop('id', axis=1, inplace=True)
data.head()

   sl_no   age gender        role
0      1  24.0      M  technician
1      2   NaN      F       other
2      3   NaN      M      writer
3      4  24.0      M  technician
4      5  33.0      F       other

In [13]:
data.drop(2,axis=0, inplace=True)
data.head()

   sl_no   age gender        role
0      1  24.0      M  technician
1      2   NaN      F       other
3      4  24.0      M  technician
4      5  33.0      F       other
5      6  42.0      M   executive

In [15]:
data.drop([4,5,6],axis=0)
data

     sl_no   age gender           role
0        1  24.0      M     technician
1        2   NaN      F          other
2        3   NaN      M         writer
3        4  24.0      M     technician
4        5  33.0      F          other
..     ...   ...    ...            ...
938    939  26.0      F        student
939    940  32.0      M  administrator
940    941  20.0      M        student
941    942  48.0      F      librarian
942    943  22.0      M        student

[943 rows x 4 columns]

In [17]:
data.mean()

sl_no    472.000000
age       34.043571
dtype: float64

In [16]:
data.mean(axis=0)

sl_no    472.497877
age       34.043571
dtype: float64

In [17]:
data.mean(axis=1)

0       12.5
1        2.0
3       14.0
4       19.0
5       24.0
       ...
938    482.5
939    486.0
940    480.5
941    495.0
942    482.5
Length: 942, dtype: float64

In [18]:
data.mean(axis=1).shape

(942,)